squareCylinderLES/testCase/system/boundaryCloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a cloud of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/
#include "../parameters"

fields (p U);

points
(
    ($P0X $P0Y $P0Z)
    ($P2X $P2Y $P2Z)
);

maxDistance 0.1;

patches     (".*");

interpolationScheme    cellPatchConstrained;

setFormat  raw;

#includeEtc "caseDicts/postProcessing/probes/boundaryCloud.cfg"

writeControl    timeStep;

// ************************************************************************* //
